---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsGraphicsAvailable
source: html/0acdd04a-8dd4-861e-59e3-874a5b0eb3c0.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsGraphicsAvailable Method

Checks whether the graphics functionality is available to support display, print, and export functionality.

## Syntax (C#)
```csharp
public static bool IsGraphicsAvailable()
```

## Returns
True if the Graphics functionality is available in the installed Revit.

## Remarks
Graphics functionality is optional functionality that does not have to be part of the Revit installation.